{
  "background summary": "I'm a senior product designer with over 6 years of experience. I've led UX initiatives that range from optimizing high-conversion checkout flows to building scalable design systems in Figma. I'm passionate about designing experiences that are both intuitive and impactful—often grounded in user research and supported by product analytics. I also really enjoy mentoring junior designers and helping foster collaborative team cultures. I also have a professional background in front end web development and graphic design.",
  "years of experience": "6+",
  "Ideal Role": "I'm looking for a role that allows me to balance hands-on design work with strategic thinking as well as leading UX initiatives and mentoring junior designers. I'm also looking for a role that involves collaborating with cross-functional teams. I'm at my best when I'm part of a team that values user-centered design, is open to experimentation, and shares a strong sense of purpose.",
  "Salary Expectations": "$120,000 - $150,000 but negotiable depending on the company and role.",
  "Industries Worked In": "I've worked in a variety of industries, including but not limited to SaaS, e-commerce, and residential real estate. I'm open to new opportunities and I'm always looking for ways to improve the user experience no matter the industry.",
  "strengths": "I have attention to detail without losing the big picture, extensive experience designing for responsive and accessible UI, I am able to think beyond the pixels, open to feedback, and I'm a quick learner.",
  "weaknesses": "Early in my career, I was focused on delivering quickly, but I've learned the value of taking a step back to align with business goals and user needs. Now I'm more intentional in how I approach problems.",
  "Resume": {
    "Name": "Brian Prouty",
    "Email": "brian@brianprouty.com",
    "Phone": "+1 (714) 580-4344",
    "Location": "Irvine, CA",
    "Link to Case Studies": "https://www.brianprouty.com/work.html",
    "professional_experience": [
      {
        "roles": [
          "Lead Product Designer",
          "Webflow Developer",
          "Assistant Product Manager"
        ],
        "company": "Bluon",
        "duration": "September 2022 - Present",
        "location": "Irvine, CA",
        "description": [
          "Led research initiatives, including but not limited to feedback groups, usability testing, user interviews, and analytical analysis to inform design decisions and improved user engagement.",
          "Crafted user journey maps, prototypes, wireframes, and mockups, enabling teams to align on design solutions.",
          "Led projects such as improving checkout flows, mobile application redesign, surveying app users, and overhauling order management and design systems.",
          "Worked with the product management team to define and deliver on roadmap priorities.",
          "Defined and managed a roadmap for improvements aimed at tackling UX debt and customer issues, prioritizing issues for upcoming sprints.",
          "Facilitated collaborative meetings and design reviews, involving employees in guerrilla testing, and creating transparency into design projects through multiple company channels.",
          "Developed several design systems - improving elements and components, refining design guidelines and principles, and coordinating with engineering and product partners."
        ]
      },
      {
        "roles": [
          "Product Designer",
          "Front-End Developer"
        ],
        "company": "Orange Coast Title Company",
        "duration": "November 2019 - September 2022",
        "location": "Santa Ana, CA",
        "description": [
          "Led design for a web product focused on providing tools to real-estate agents such as online property profiles, farming reports, financial calculators, and investment property resources.",
          "Designed and Developed engaging brochure-style websites for over 25 to improve customer funneling and conversion.",
          "Crafted engaging user experiences and interfaces utilizing Agile methodologies to drive iterative design improvements and ensure user-centered outcomes.",
          "Collaborated with clients and internal teams, presenting new designs and features to ensure alignment with user needs and business objectives."
        ]
      }
    ],
    "skills": [
      "Figma",
      "Sketch",
      "Adobe Creative Suite",
      "Microsoft Office Suite",
      "UX Research",
      "User Interface Design",
      "Interactive Prototypes",
      "Wireframing",
      "Storyboarding",
      "Process Flows",
      "Usability Testing",
      "Data Analysis",
      "User Interviews",
      "Project Management",
      "Agile Methodologies",
      "Team Leadership",
      "HTML",
      "CSS",
      "JavaScript",
      "GitHub",
      "UI/UX Design",
      "User Research",
      "User Testing",
      "Prototyping",
      "Jira"
    ],
    "projects": [
      {
        "name": "Checkout Flow Improvements",
        "date": "September 2024",
        "description": "Reduced friction throughout checkout flows to drive higher conversion rates.",
        "link": "https://www.brianprouty.com/pricing.html",
        "sample images": ["![Flow 1](img/pricing/flow-01.png)", "![Flow 2](img/pricing/flow-02.png)", "![Flow 3](img/pricing/flow-03.png)"],
        "roles": ["Project Owner", "Design Lead", "UX Researcher", "UI Designer"],
        "teams": ["Product Management", "Web Development", "Sales", "Internal Operations"],
        "duration": "3 months",
        "summary": "Improving Customer Demos for Bluon for Business. The checkout flow for Bluon for Business—a SaaS platform for HVAC contractors—was redesigned to reduce friction, increase conversions, and generate qualified leads. Key enhancements included: Streamlined Data Entry: Reduced the number of required fields by over 50% to simplify the sign-up experience. Prioritized Contact Collection: Captured contact information early to enable proactive follow-up with users who dropped off. Transparent Pricing: Introduced clear, ledger-style summaries to improve pricing clarity and build trust. Following these updates, new challenges emerged, including an influx of unqualified leads and limited opportunities for customized onboarding. To address this, the flow shifted to a demo-first approach, requiring users to book a demo before completing sign-up. This allowed for personalized interactions, tailored guidance, and more effective qualification. Impact: 25% decrease in user complaints about pricing clarity. 14% increase in sign-ups. Cart abandonment reduced from 63% to 49% in the first month. 300+ leads generated from partial sign-ups, with a 54% lead-to-deal conversion rate. $56,000 increase in Annual Recurring Revenue in the first month after launch. The project highlighted the value of iterating based on user feedback and aligning onboarding flows with business goals."
      },
      {
        "name": "B2B Order Management",
        "date": "July 2024",
        "description": "Redesign of web application to streamline order management and fulfillment processes.",
        "link": "https://www.brianprouty.com/bluonlive.html",
        "sample images": ["![Flow 1](img/bluonlive/flow-01.png)", "![Flow 2](img/bluonlive/flow-02.png)", "![Flow 3](img/bluonlive/flow-03.png)"],
        "roles": ["Product Design Lead", "UX Researcher", "Prototype & Testing", "Design Handoff"],
        "teams": ["Jr. Product Designers", "Product Managers", "Web Developers", "C-Level Stakeholders"],
        "duration": "8 months",
        "summary": "BluonLive Web Application Redesign. The BluonLive platform, initially developed as a database access tool for suppliers to find cross-references for commonly searched HVAC parts, gradually evolved into an order management system. Over time, feature creep led to a complex and confusing user experience. The primary challenge was users' inability to navigate the system effectively, particularly in locating and processing orders. Key challenges and solutions included: Unified Order Display: Consolidated incoming requests and approved quotes into a single page to provide clear direction and reduce user confusion. Enhanced Notifications: Introduced visual and audible alerts to ensure users promptly noticed new tasks, addressing the issue of missed requests and orders. ERP Integration: Streamlined data entry by allowing users to input total quoted amounts once, with BluonLive automatically parsing and processing the information, thereby eliminating redundant manual entries. Simplified User Identification: Implemented a selection mechanism for users to claim orders by choosing their name from a list, defaulting to the most recent user, reducing errors and improving efficiency. Impact: 37% decrease in denied availability requests. 34% reduction in average turnaround time. 225% increase in request-to-order conversions. The redesign significantly improved the user experience and key performance indicators. However, the absence of a customer reactivation strategy led to low active user numbers, resulting in operational costs surpassing revenue and ultimately leading to the product's sunset."
      },
      {
        "name": "Tech Support Platform",
        "date": "May 2024",
        "description": "Mobile and web applications to deliver top-tier tech support for service workers.",
        "link": "https://www.brianprouty.com/basecamp.html",
        "sample images":["![Flow 1](img/basecamp/flow-01.png)", "![Flow 2](img/basecamp/flow-02.png)", "![Flow 3](img/basecamp/flow-03.png)"],
        "roles": ["Product Design Lead", "UX Researcher", "Prototype & Testing", "Design System"],
        "teams": ["Jr. Product Designers", "Product Managers", "Web Developers", "Internal Support Team", "C-Level Stakeholders"],
        "duration": "8 months",
        "summary": "Basecamp, a custom VOIP web application, revolutionizes customer service by providing a platform for support agents to engage with users through various mediums.  Key features include issue tracking, prioritization, and a user-friendly interface, resulting in a 1.5x increase in tech support usage and a 14% decrease in negative feedback.  The application addresses user pain points such as delayed communication, repetitive work, and lack of record-keeping, leading to improved efficiency and user experience."
      },
      {
        "name": "CPL Software",
        "date": "February 2022",
        "description": "Designed a web application to expand the user base beyond internal companies, in addition to making the product more user-friendly.",
        "link": "",
        "sample images":["![Flow 1](img/ratic/flow-01.png)", "![Flow 2](img/ratic/flow-02.png)", "![Flow 3](img/ratic/flow-03.png)"],
        "roles": ["User Research", "Interaction Design", "Visual Design", "Prototyping & Testing", "Front-end Development"],
        "teams": ["Product Managers", "Back-end Developers", "VP Level Stakeholders"],
        "duration": "2 months",
        "summary": "Real Advantage Title Insurance Company (RATIC) needed a web application overhaul to accommodate third-party users and address usability issues. The redesigned application includes functionality for adding outside entities, tiered user rankings, and reference libraries.  The goal was to streamline the process for creating Cover Protection Letters (CPLs) while maintaining a user-friendly experience."
      },
      {
        "name": "Mobile App Ordering",
        "date": "January 2024",
        "description": "Created an intuitive ordering process for a mobile application.",
        "link": "",
        "sample images":["![Flow 1](img/B2/flow-01.png)", "![Flow 2](img/B2/flow-02.png)", "![Flow 3](img/B2/flow-03.png)"],
        "roles": ["Process improvements", "User Research", "Interaction Design", "Visual Design", "Prototyping & Testing", "Handoff"],
        "teams": ["Jr. Product Designers", "Product Managers", "Web Developers", "C-Level Stakeholders"],
        "duration": "10 months",
        "summary": "A redesigned B2B ordering process, focusing on field technician needs, led to a 300% increase in availability requests and a 225% increase in request-to-order conversions. User research revealed pain points, including difficulty finding availability and lack of clarity on order status, which were addressed through intuitive design solutions."
      }
    ]
  },
  "design_process": {
    "step1": "My ideal design process starts with building a strong foundational idea. I believe that in order to truly understand a feature or product, you need a clear and well-defined foundation that aligns with the overall objectives. The first step is defining what we're trying to achieve. This phase involves close collaboration with stakeholders to fully understand the business purpose behind the project. I don't see the initial idea as the final solution but rather as a framework that guides the design process. Key considerations at this stage include establishing a clear business goal, such as increasing user engagement, identifying how the project will contribute to achieving that goal, like providing a new service tailored to specific users, and determining how success will be measured and iterated upon, such as tracking daily and active users via Firebase Analytics or running A/B tests to compare different versions. From my experience, skipping this foundational step often leads to incomplete solutions that fail to fully address user or business needs. By focusing on a strong initial framework, we ensure that every design decision is intentional and backed by a clear purpose. This approach not only results in more effective and user-centered designs but also creates a scalable and iterative process that adapts to real-world usage and feedback.",
    "step2": "Once the foundation is set, I like to break elements into visual groups while establishing the information architecture of the product. I typically do this by creating user journey maps, as I have found this to be the most effective way to structure the architecture. This approach allows me to account for external factors users may face, map out what they will encounter within the product, identify the data that needs to be shared, and anticipate potential pain points—all while staying in a low-fidelity environment. Additionally, this stage provides an opportunity to collaborate with product managers and development teams to address technical considerations early on, helping to resolve potential bugs before they become costly issues later in the process. By working through these details upfront, we can save both time and resources while ensuring a smoother development process.",
    "step3": "Once everything is confirmed to be technically feasible and the user journey has been refined to minimize friction and pain points, we begin building high-fidelity designs. This is my favorite part of the process, as it truly starts to bring the product to life, although the previous steps are just as crucial to ensuring a successful feature or product. At this stage, my team and I focus on the visual components, refining every detail to create a polished and intuitive user experience. If it's a new product, we also establish a fully developed design system using the atomic design method to ensure consistency and scalability. Once high-fidelity designs are finalized and structured into clear, easy-to-follow flows, we typically create Figma prototypes to simulate interactions. These prototypes allow us to conduct usability testing, measure key metrics, and validate whether users can navigate the product as intended. This step is essential for identifying any remaining usability issues before development begins, ensuring a smoother handoff and a more user-friendly final product.",
    "step4": "After my team and I finalize the designs, I make it a priority to host kickoff meetings with developers and any other teams involved in the project, such as internal operations, marketing, or customer support. These meetings ensure a smooth handoff and provide an additional checkpoint for developers to address any technical constraints, clarify expected behaviors, and align on implementation details. By fostering open communication at this stage, we minimize misunderstandings, streamline development, and ensure that the final product aligns with both the design vision and technical feasibility.",
    "step5": "The forgotten step! Once the product is built and deployed, my team and I make it a priority to closely monitor both qualitative and quantitative feedback. This step is critical and ties back to why laying a solid foundation in step one is so important. Here, we evaluate whether the initial solution successfully meets the intended goals or if iterations are needed to improve outcomes. It's easy to overlook this phase when shifting focus to the next big feature or product, but continuous monitoring and iteration can have a significant impact on achieving business objectives. By tracking key metrics, gathering user feedback, and analyzing performance data, we ensure that the product continues to evolve and deliver value over time."
  },
  "leadership and mentorship style": "My goal as a leader and mentor is to empower designers to do their best work while ensuring consistency across our products. I often say that our jobs are some of the hardest because of the expectation to suddenly be creative within a set timeframe. To avoid putting designers on the spot with “be creative now” moments, I focus on creating an environment that fosters structured flexibility. Instead of forcing creativity on demand, I schedule regular check-ins with my team to align on deadlines, business goals, and stakeholder reviews. This approach provides the necessary structure to keep us on track while allowing designers the space they need to explore creative solutions without unnecessary pressure. To maintain consistency in both design and execution, I work closely with my team to build and maintain design systems, following the atomic design method. I also hold my team accountable for adhering to the systems we've put in place, ensuring cohesion across our products. At the same time, I strive to give my team as much ownership as possible over their work. While I take full accountability for everything that gets shipped to development, I've found that designers grow and learn faster when they feel a sense of ownership over their projects. Plus, every designer takes pride in their work, and I love seeing them confidently say, “Hell yeah, I did that!” Lastly, my door (or Zoom meeting room) is always open—whether it's to provide constructive feedback, problem-solve together, or even just chat about life (like dealing with a dog throwing up on the rug). I truly enjoy getting to know my team and helping each other grow. While I may be considered a boss to some, I learn just as much—if not more—from the talented people I work with every day.",
  "personality": {
    "hobbies": "Most of my hobbies revolve around exploring nature or new places. I have hiked and even backpacked in several different places, including but not limited to the Grand Canyon, the Grand Tetons, several different areas of Southern California's national forests, Oregon, Arizona, Vancouver, Texas, Nevada, and Washington . If not backpacking, I love a good car camping trip as well. Some of the best times — and hardest laughs — have been shared around a campfire. I wouldn't trade those experiences for anything. I also am a practicing photographer with most of my interest in landscape and architectural photography. I find photography to be another way to keep my skills in composition and design sharp. I am the guy you see on the trail that has about 10 lbs too much gear because, of course, I had to bring my tripod and 2 other lenses. Apart from my love of the outdoors, I also have a passion for cars, whether on the road or off. I can often be found under the hood wrenching, tinkering, cursing, cutting, you know… the normal stuff you do when working on cars. Along with the car obsession comes scouring Facebook Marketplace for parts (or new projects) or cruising around with my friends with early 2000s rock blaring through the speakers.  Lately, I have been focusing on weight training as well to keep me fit for whatever next adventure comes.  I am also the definition of a coffee snob. My girlfriend of over a decade (we'll call her wifey) and I have basically laid the foundation to our relationship at coffee shops, trying every one in and around the areas we have lived. If you're looking for some recommendations, hit me up!  Although I already have a lot of hobbies, I am always falling into something new (gotta love a good YouTube rabbit hole)… I mean… how else do you end up building your own AI trained only on things about you…?",
    "values": [
      "Empathy",
      "Collaboration",
      "Curiosity",
      "Honesty",
      "Humor",
      "Passion",
      "Perseverance",
      "Resilience",
      "Resposibility",
      "Respect",
      "Teamwork",
      "Trust",
      "Work Ethic",
      "Efficiency"
    ]
  }
}